#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/rocky-mountain-chile-man/kubernetes-ops-dev-eks/runs/run-sW8FLgJmLJYofcvU

Waiting for the plan to start...

Terraform v1.7.4
on linux_amd64
Initializing plugins and modules...
data.terraform_remote_state.vpc: Refreshing...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Refreshing...
module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/dev/cluster]
module.eks.module.eks_managed_node_group["example"].data.aws_iam_policy_document.assume_role_policy[0]: Refreshing...
module.eks.module.kms.data.aws_partition.current[0]: Refreshing...
module.eks.data.aws_caller_identity.current: Refreshing...
module.eks.module.eks_managed_node_group["example"].data.aws_partition.current: Refreshing...
module.eks.module.eks_managed_node_group["example"].data.aws_caller_identity.current: Refreshing...
module.eks.module.eks_managed_node_group["example"].data.aws_partition.current: Refresh complete after 0s [id=aws]
module.eks.data.aws_partition.current: Refreshing...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Refresh complete after 0s [id=2764486067]
module.eks.module.eks_managed_node_group["example"].data.aws_iam_policy_document.assume_role_policy[0]: Refresh complete after 0s [id=2560088296]
module.eks.data.aws_partition.current: Refresh complete after 0s [id=aws]
module.eks.module.kms.data.aws_partition.current[0]: Refresh complete after 0s [id=aws]
module.eks.module.kms.data.aws_caller_identity.current[0]: Refreshing...
module.eks.aws_iam_role.this[0]: Refreshing state... [id=dev-cluster-20240309052616317400000003]
module.eks.module.eks_managed_node_group["example"].aws_iam_role.this[0]: Refreshing state... [id=example-eks-node-group-20240316035210341000000001]
module.eks.data.aws_caller_identity.current: Refresh complete after 0s [id=211125552941]
module.eks.data.aws_iam_session_context.current: Refreshing...
module.eks.data.aws_iam_session_context.current: Refresh complete after 0s [id=arn:aws:iam::211125552941:user/k8s-cluster-manager-dev]
data.terraform_remote_state.vpc: Refresh complete after 1s
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0bdf85692c0b9e3e6]
module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-0e809159d97d45e49]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=dev-cluster-20240309052616317400000003-20240309052616641200000008]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=dev-cluster-20240309052616317400000003-20240309052616641800000009]
module.eks.module.eks_managed_node_group["example"].data.aws_caller_identity.current: Refresh complete after 0s [id=211125552941]
module.eks.module.eks_managed_node_group["example"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=example-eks-node-group-20240316035210341000000001-20240316035210639100000004]
module.eks.module.eks_managed_node_group["example"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=example-eks-node-group-20240316035210341000000001-20240316035210604000000003]
module.eks.module.eks_managed_node_group["example"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=example-eks-node-group-20240316035210341000000001-20240316035210596700000002]
module.eks.module.kms.data.aws_caller_identity.current[0]: Refresh complete after 0s [id=211125552941]
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Refreshing...
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Refresh complete after 0s [id=3892431048]
module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=61652a49-b01f-4a10-982a-4a6ea896a7c2]
module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-3147811832]
module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-12890815]
module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-257910279]
module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-2761625936]
module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-1811830220]
module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-494604482]
module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-3577822640]
module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-1903730782]
module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-3091776792]
module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-469981734]
module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-707917074]
module.eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/dev]
module.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::211125552941:policy/dev-cluster-ClusterEncryption2024030905263806820000000a]
module.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=dev-cluster-20240309052616317400000003-2024030905263827600000000b]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=dev]
module.eks.aws_eks_access_entry.this["cluster_creator"]: Refreshing state... [id=dev:arn:aws:iam::211125552941:user/k8s-cluster-manager-dev]
module.eks.aws_ec2_tag.cluster_primary_security_group["Environment"]: Refreshing state... [id=sg-03b8d7c67fdc66bc5,Environment]
module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Refreshing...
module.eks.time_sleep.this[0]: Refreshing state... [id=2024-03-09T16:34:22Z]
module.eks.aws_eks_access_entry.this["example"]: Refreshing state... [id=dev:arn:aws:iam::211125552941:user/kube-admin]
module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Refreshing...
module.eks.aws_ec2_tag.cluster_primary_security_group["Terraform"]: Refreshing state... [id=sg-03b8d7c67fdc66bc5,Terraform]
module.eks.data.aws_eks_addon_version.this["coredns"]: Refreshing...
module.eks.data.tls_certificate.this[0]: Refreshing...
module.eks.module.eks_managed_node_group["example"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=314111629995969132]
module.eks.module.eks_managed_node_group["example"].aws_launch_template.this[0]: Refreshing state... [id=lt-0ec2e18b0b04e242e]
module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Refresh complete after 0s [id=kube-proxy]
module.eks.data.tls_certificate.this[0]: Refresh complete after 0s [id=6306a5e535892bdf6f4386e934be19a955e64ffa]
module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::211125552941:oidc-provider/oidc.eks.us-west-2.amazonaws.com/id/2B9CD302651D2475CBF5AFC1FF581F91]
module.eks.data.aws_eks_addon_version.this["coredns"]: Refresh complete after 0s [id=coredns]
module.eks.module.eks_managed_node_group["example"].aws_eks_node_group.this[0]: Refreshing state... [id=dev:example-20240316035211133100000007]
module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Refresh complete after 0s [id=vpc-cni]
module.eks.aws_eks_addon.this["vpc-cni"]: Refreshing state... [id=dev:vpc-cni]
module.eks.aws_eks_addon.this["coredns"]: Refreshing state... [id=dev:coredns]
module.eks.aws_eks_addon.this["kube-proxy"]: Refreshing state... [id=dev:kube-proxy]
module.eks.aws_eks_access_policy_association.this["cluster_creator_admin"]: Refreshing state... [id=dev#arn:aws:iam::211125552941:user/k8s-cluster-manager-dev#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
module.eks.module.eks_managed_node_group["example"].aws_eks_node_group.this[0]: Drift detected (update)
module.eks.module.eks_managed_node_group["example"].aws_iam_role.this[0]: Drift detected (update)
module.eks.module.eks_managed_node_group["example"].aws_launch_template.this[0]: Drift detected (update)
module.eks.aws_eks_addon.this["coredns"]: Drift detected (update)

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.eks.module.eks_managed_node_group["example"].aws_eks_node_group.this[0] has changed
  ~ resource "aws_eks_node_group" "this" {
        id                     = "dev:example-20240316035211133100000007"
      + labels                 = {}
        tags                   = {
            "Environment" = "dev"
            "Name"        = "example"
            "Terraform"   = "true"
        }
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.eks.aws_eks_access_entry.this["dev-admin"] will be created
  + resource "aws_eks_access_entry" "this" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "dev"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = (known after apply)
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::211125552941:user/kube-admin"
      + tags              = {
          + "Environment" = "dev"
          + "Terraform"   = "true"
        }
      + tags_all          = {
          + "Environment" = "dev"
          + "Terraform"   = "true"
        }
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # module.eks.aws_eks_access_entry.this["example"] will be destroyed
  - resource "aws_eks_access_entry" "this" {
      - access_entry_arn  = "arn:aws:eks:us-west-2:211125552941:access-entry/dev/user/211125552941/kube-admin/d6c71208-27b8-6dbe-672e-4bb4d0131e44" -> null
      - cluster_name      = "dev" -> null
      - created_at        = "2024-03-09T16:33:52Z" -> null
      - id                = "dev:arn:aws:iam::211125552941:user/kube-admin" -> null
      - kubernetes_groups = [] -> null
      - modified_at       = "2024-03-09T16:33:52Z" -> null
      - principal_arn     = "arn:aws:iam::211125552941:user/kube-admin" -> null
      - tags              = {
          - "Environment" = "dev"
          - "Terraform"   = "true"
        } -> null
      - tags_all          = {
          - "Environment" = "dev"
          - "Terraform"   = "true"
        } -> null
      - type              = "STANDARD" -> null
      - user_name         = "arn:aws:iam::211125552941:user/kube-admin" -> null
    }

  # module.eks.aws_eks_access_policy_association.this["dev-admin_dev-admin"] will be created
  + resource "aws_eks_access_policy_association" "this" {
      + associated_at = (known after apply)
      + cluster_name  = "dev"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:iam::211125552941:user/kube-admin"

      + access_scope {
          + namespaces = [
              + "default",
            ]
          + type       = "namespace"
        }
    }

Plan: 2 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ cluster_addons                     = {
      ~ coredns    = {
            id                          = "dev:coredns"
          ~ modified_at                 = "2024-03-16T03:37:27Z" -> "2024-03-17T02:06:41Z"
            tags                        = {
                Environment = "dev"
                Terraform   = "true"
            }
            # (13 unchanged attributes hidden)
        }
        # (2 unchanged attributes hidden)
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```


</details>

*Pusher: @joel-grant, Action: `pull_request`*